yt11dev.СК/src/DataProcessors/СК_НастройкаОбменБух/СК_НастройкаОбменБух.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>СК_НастройкаОбменБух</name>
  <attributes>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресБД</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

yt11dev.СК/src/DataProcessors/СК_НастройкаОбменБух/Forms/Форма/Module.bsl
&НаСервере
Процедура СохранитьНаСервере()
	АдресСервера = Константы.СК_БухСервер.СоздатьМенеджерЗначения();
	АдресСервера.Прочитать();
	АдресСервера.Значение = Объект.АдресСервера; 
	АдресСервера.Записать();
	
	Пользователь = Константы.СК_БухПользователь.СоздатьМенеджерЗначения();
	Пользователь.Прочитать();
	Пользователь.Значение = Объект.Пользователь;
	Пользователь.Записать();
	
	Пароль = Константы.СК_БухПароль.СоздатьМенеджерЗначения();
	Пароль.Прочитать();
	Пароль.Значение = Объект.Пароль;
	Пароль.Записать();

	БухБД = Константы.СК_БухБД.СоздатьМенеджерЗначения();
	БухБД.Прочитать();
	БухБД.Значение = Объект.АдресБД;
	БухБД.Записать();
	
КонецПроцедуры



&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере()
КонецПроцедуры
